"""
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку 
здійснюється за механізмом 
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення, 
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""

student = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}
# ваш код нижче
student_numbers = len(student)

total_score = 0
exelent_student_list = []

for name, data in student.items():
    if data.get('Середній бал') >90:
        exelent_student_list.append((name, data.get('Середній бал'))) #бал вище 90
    data_list = data.get('Середній бал', 0)
    total_score += data_list   #середній бал студентів
average_score = total_score/student_numbers
print(average_score, 'Середній бал студентів')
print(exelent_student_list, 'Оцінка студентів >90 балів')
#4.Якщо у студента відсутній телефон
for name, phone_number in student.items():
    if phone_number.get('Номер телефону') == None:
        print(name, '-Потрібні контакти батьків!')